Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །དེ་ནས་བདུད་ཤོར་བ་ནམ་མཁའི་ཤིང་ཞེས་བྱ་བ་དེས་བདུད་སྡིག་ཅན་ལ་ཚིགས་སུ་བཅད་པས་དྲིས་པ།
en: One māra leader named Celestial Tree questioned the evil Māra with these verses:

source: འཁྲུག་སེམས་ཡིད་རབ་མི་བདེ་བས། །ཅི་སླད་དེ་ལྟར་ཁྱོད་རྒྱུག་ཅིང་།
en: “Why do you run around like that With such agitation and distress?

source: །ཀུན་ལ་དགའ་བར་མི་དགོངས་པས།
en: It seems that nothing can make you happy,

source: །གང་དུ་ཡང་ནི་དགྱེས་མི་མངའ།
en: And nothing pleases you.”

source: །བདུད་སྡིག་ཅན་གདོང་མཆི་མ་དང་བཅས་པས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: With tears in his eyes, the evil Māra replied:

source: །གཽ་ཏ་མ་སྟོབས་ཅན་མཐོང་ནས་ནི།
en: “When I saw the powerful Gautama,

source: །ང་ཡི་སྙིང་ནི་རྣམ་གས་ནས།
en: My heart cracked into pieces.

source: །ལུས་ཀུན་ནས་ནི་རྡུལ་འཐོན་ཅིང་།
en: Dirt leaked from my entire body,

source: །གདོང་ཡང་མཆི་མས་གང་བ་ཡིན།
en: And my eyes were filled with tears.

source: །སེམས་ཅན་ཐམས་ཅད་འཐུན་པ་རུ། །ཇི་ལྟར་ཐོས་པ་བཞིན་དུ་དེར།
en: “Since that entire mass of beings has gathered To hear his teachings,

source: །ཚོགས་ཆེན་རིལ་གྱིས་དོང་བས་ན། །ང་ཡི་ཡུལ་ནི་སྟོངས་པར་བྱས།
en: That are so agreeable to all beings, My domain has been emptied.

source: །ནམ་མཁའ་དང་ནི་མཚུངས་པའི་ཡུལ། །ཕྱོགས་བཅུ་ནས་ནི་ལྷགས་པ་ཡིས།
en: “Tens of millions of beings Have arrived there from the ten directions—From places infinite like space.

source: །དེ་ལ་བསྐོར་བ་བྱས་ནས་སུ། །བྱེ་བ་མང་པོས་ཡོངས་སུ་བསྐོར།
en: They have circumambulated him and are now sitting around him.

source: །བདུད་རྣམས་ཐམས་ཅད་འཁོར་བཅས་ཏེ།
en: “All the māras and their retinues

source: །དེ་ལ་ཡང་ནི་སྐྱབས་སོང་བས།
en: Have also gone for refuge in him.

source: །ང་ཡི་དཔུང་ནི་མ་མཐོང་སྟེ།
en: Even my armies have disappeared—

source: །གང་ནའང་ང་ཡི་ཕྱོགས་མེད་དོ།
en: I cannot find them anywhere!”

source: །དེ་ནས་བདུད་སྡིག་ཅན་ལ་བདུད་ཤོར་བ་ནམ་མཁའི་ཤིང་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The māra leader Celestial Tree then said to the evil Māra:

source: །བདག་ཅག་ཐམས་ཅད་འཁོར་བཅས་ཏེ། །གོ་ཆ་སྲ་བ་དག་བགོས་ནས། །རལ་གྲི་འཁོར་ལོ་མདའ་བོ་ཆེས། །དེ་ཡི་ལུས་ནི་ཕྱེ་མར་རླག །
en: “All of us, with our retinues, Should don our strongest armor And go pulverize his body With our mighty swords, wheels, and lances!”

source: སྡིག་ཅན་གྱིས་སྨྲས་པ།
en: The evil Māra replied:

source: དེ་ལ་ཡང་ནི་སྐྱབས་སོང་ཞིང་། །དེར་ཡང་རང་ཉིད་སོང་བས་ན།
en: “Better if you go there yourself And first take refuge in him.

source: །དེ་ལ་དམག་ནི་ཡང་དག་ཕུལ།
en: Then you can attack him!

source: །ང་ནི་བཅིང་བ་དམ་པོས་བཅིངས།
en: I myself am bound by tight fetters.”

source: །དེ་ནས་བདུད་ཤོར་བ་ནམ་མཁའི་ཤིང་དེས་སྨྲས་པ།
en: The māra leader Celestial Tree then said:

source: ཐབས་རྣམས་ཀུན་གྱིས་ཅི་བགྱིས་ཀྱང་།
en: “Whatever method we might use,

source: །དགྲ་ནི་དབང་དུ་མི་འགྱུར་ཏེ།
en: It will not be enough to overcome our enemy.

source: །མཛའ་བོའི་གཟུགས་ཀྱིས་བསླུས་བགྱིས་ན།
en: Yet, if we fool him by assuming a friendly appearance,

source: །དེ་ལྟ་ན་ནི་གསད་པར་ནུས།
en: We will be able to kill him!”

source: །སྡིག་ཅན་གྱིས་སྨྲས་པ།
en: The evil Māra replied:

source: མཛའ་བོའི་གཟུགས་ཀྱིས་དེར་འགྲོ་བར། །འདི་ལྟར་བདག་གིས་དེ་བསམས་ནས།
en: “I have thought about Going there while assuming a friendly appearance,

source: །རང་གི་མགུལ་ན་དྲི་ང་བའི།
en: But he would see the frightening and stinking

source: །རོ་མྱགས་འཇིགས་སུ་རུང་བ་མཐོང་།
en: Rotten corpses around our necks.”

source: །ནམ་མཁའི་ཤིང་གིས་སླར་སྨྲས་པ།
en: Celestial Tree replied:

source: །བདུད་དང་ཀླུ་དང་བསམ་གཏན་པའི། །ཡུལ་གསུམ་དག་ཏུ་བཤད་པ་ལ།
en: “With respect to the domain of the māras, The nāgas, and those who have reached the concentrations,

source: །བདག་ཅག་གི་ནི་ཡུལ་བཅོམ་ཡང་།
en: Our domain has been conquered,

source: །ཀླུ་རྣམས་ཀྱི་ནི་ཡུལ་བརྟན་ནོ།
en: But the domain of the nāgas has remained firm.

source: །ཀླུ་དེ་དག་ཀྱང་གཟི་བརྗིད་ཆེ།
en: “Those nāgas have great might,

source: །དམག་རྣམས་མང་ཞིང་སྟོབས་ཀྱང་ཆེ། །དེ་དག་གི་ནི་ཡུལ་མཆིས་པ།
en: And their troops are numerous and powerful. Their domain cannot be conquered

source: །ཀུན་ཏུ་གཞན་གྱིས་མི་ཐུབ་ལགས།
en: By anyone! “Let us quickly ask

source: །འདོད་པའི་ཁམས་ན་གང་སུ་དག །ཀླུ་ཡི་བདག་པོ་གནས་གྱུར་པ། །དེ་དག་རྣམས་ལ་གཽ་ཏ་མ།
en: The rulers of the nāgas, Who reside in the desire realm,

source: །ཐལ་བར་རླག་པར་མྱུར་དུ་བསྒོ།
en: To crush Gautama into dust!”

source: ཀྱེ་བསོད་ནམས་ཤེས་རབ་ཆེན་པོ་ཅན།
en: “O, you fine and wise being,

source: །ཀླུ་ཡི་གནས་སུ་ཉིད་སོང་ལ། །
en: Go to the realm of the nāgas

source: གཽ་ཏ་མ་དང་དམག་འགྱེད་པར། །ཐམས་ཅད་ལ་ནི་ཁྱོད་ཀྱིས་བསྒོ།
en: And tell them all To wage a war against Gautama!”

source: །དེས་སྨྲས་པ། དེ་བཞིན་དུ་བགྱིའོ་ཞེས་ནས་དམག་བརྒྱ་སྟོང་གོ་བགོས་པ་དེ་དག་ལ། ལག་པ་བསྒྲེང་སྟེ་བསྒྲགས་པ་ནི།
en: “I shall do so!” replied Celestial Tree. He then raised his arm toward a hundred thousand soldiers wearing armor and proclaimed:

source: །ཀླུ་ཡི་རྟེན་དུ་བདག་ཅག་འདེང་།
en: “We are going to the abode of the nāgas.

source: །གཽ་ཏ་མ་དང་དམག་འགྱེད་ཅིང་། །སྲོག་དང་བྲལ་བར་བྱེད་དུ་གཞུག །
en: We will make them wage war against Gautama And kill him!

source: དེར་ནི་བདག་ཅག་གྲོགས་བྱ་བར།
en: We must convince them all to become our allies.”

source: །ཐམས་ཅད་ལ་ནི་བསྒོ་བར་བྱ། །དེ་ན་འཁོད་པ་དེ་དག་ཀྱང་གང་དུ་ཡང་། སུ་ཡང་འགྲོ་བར་མ་ནུས་པ་དང་། ཤོར་བ་ནམ་མཁའི་ཤིང་དེ་གདོང་མཆི་མ་དང་བཅས་ཤིང་སྤུ་ཟིང་ཞེས་བྱེད་པར་གྱུར་ཏེ།
en: However, none of the soldiers were able to move, so the leader Celestial Tree began to weep, and his hairs stood on end.

source: ཐལ་མོ་རབ་ཏུ་སྦྱར་བ་བྱས་ནས་སྡིག་ཅན་ལ་སྨྲས་པ།
en: With his palms joined, he supplicated the evil Māra:

source: བདག་ཅག་གིས་ནི་གང་དུ་ཡང་། །མཆི་བར་བགྱི་བའི་རྔོ་མ་ཐོགས།
en: “We are unable To go anywhere!

source: །སྒྱུ་འཕྲུལ་བརྟན་པ་གཽ་ཏ་མ།
en: This is the powerful magical power of Gautama!

source: །དྲང་སྲོང་གི་ནི་སྒྱུ་ལགས་སོ།
en: This is the trickery of the sage!

source: །བདག་ཅག་ཐམས་ཅད་རྐང་པ་བཅིངས།
en: “Our legs are bound,

source: །ལུས་རྣམས་ཀུན་ལ་རྡུལ་ཡང་བྱུང་།
en: And dirt emerges from our bodies.

source: །གང་གིས་དགྲ་ལས་ཁྱེད་རྒྱལ་བར། །གཞན་ཞིག་ཀྱང་ནི་མཛད་པར་གསོལ།
en: Please do something To overcome our enemy!”

source: །བདུད་སྡིག་ཅན་ཇེ་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་ནས་མྱ་ངན་དུ་གྱུར་པ་དེ་འདི་ལྟ་བུའི་བློ་སྐྱེས་ཏེ།
en: Tormented by increasing suffering and distress, a thought arose in the mind of the evil Māra:

source: གང་བདག་གིས་ཀླུའི་རྟེན་ཐམས་ཅད་དུ་གང་ཀུན་ཏུ་སྨྲ་བར་བྱེད་པ་དང་། མངོན་པར་མི་དགའ་བ་སྐྱེད་པར་བྱེད་པ་དང་། ཀླུ་ཐམས་ཅད་ཀུན་དུ་གཤེ་བར་བྱེད་པའི་བདུད་ཀྱི་སྟོབས་དེ་ལྟ་བུ་ཡང་དག་པར་རྗེས་སུ་དྲན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ།
en: “Now I must by all means bring to mind my demonic power, so that I can address all the nāgas in their abodes and make them upset and irate!”

source: །དེ་ནས་དེའི་ཚེ་བདུད་སྡིག་ཅན་གྱིས་ཀླུའི་རྟེན་ཐམས་ཅད་དུ་ཤ་སྦྲང་དང་། སྦྲང་བུ་མཆུ་རིངས་དང་། སྦྲང་བུ་གདུག་པ་རྣམས་སྤྲུལ་ཏོ། །ཐམས་ཅད་དྲི་ང་བས་བཀང་ངོ་།
en: At that moment, the evil Māra manifested flesh flies, mosquitoes, and hornets in all the abodes of the nāgas, and he filled these places with disgusting smells.

source: །རྡུལ་དབྱུང་བ་དང་མངོན་པར་མི་དགའ་བར་བྱས་སོ།
en: He made dirt emerge from the nāgas’ bodies, and everyone became unhappy.

source: །དེ་བཞིན་དུ་ཀླུ་དང་། ཀླུ་ཆེན་པོ་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་ཐམས་ཅད་མངོན་པར་མི་དགའ་ནས་དེ་དག་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བལྟས་ཏེ། བདག་ཅག་ལ་ཅོ་འདྲི་བར་བྱེད་པ་སུ་ཡིན་སྙམ་ན་དེ་དག་གིས་མ་ཤེས་ཤིང་མ་མཐོང་ངོ་།
en: Upset, all the nāgas, the great nāgas, and the nāga women, boys, and girls started to look around and wonder, “Who is making fun of us?” They did not understand what was happening, as they could not see anyone.

source: །གླིང་བཞི་པ་འདིའི་ཀླུ་དང་། ཀླུ་ཆེན་པོ་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་གང་དག་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁྲོ་བས་ཟིལ་གྱིས་ནོན་ནས་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་རང་གི་གནས་བོར།
en: Overwhelmed by anger, all the nāgas, great nāgas, and nāga women, boys, and girls in this four-continent world left their residences.

source: ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་གཉིས་འཁོར་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཀྱང་རང་གི་གནས་བོར་ནས་རིའི་རྒྱལ་པོ་རི་རབ་ཀྱི་འདབ་ན་རི་ཁ་ལ་ཏི་ཡ་ཞེས་བྱ་བ་ཡོད་དེ།
en: The two nāga kings Nanda and Upananda also left their residences with retinues of many hundreds of thousands. Alongside Mount Sumeru, there is a mountain called Kalatiya.

source: རི་ཁ་ལ་ཏི་ཡ་དེའི་རྩེ་མོ་ན་དྲང་སྲོང་ཐུབ་པ་རྣམས་ཀྱི་གནས་ཀྱི་རྟེན་ཀུན་རྟེན་ཅེས་བྱ་བ་རྒྱར་དཔག་ཚད་བཞི་ཁྲི་པ་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བརྒྱན་པ་བཞི་ཡོད་པ།
en: On the summit of that mountain there is a sacred site of wise sages called Complete Support. It covers an area of forty thousand leagues, and it is ornamented with the divine seven precious substances.

source: དྲང་སྲོང་ཐུབ་པའི་གནས་དེར་སྐྱབས་ཀྱི་དོན་དུ་རྟེན་ཅིང་ཞུགས་སོ།
en: The nāgas entered that sacred site of wise sages to find shelter.

source: །དེར་དེ་དག་ཞུགས་མ་ཐག་ཏུ་འདི་ལྟ་བུའི་ལུས་ཆུང་ངུར་གྱུར་ཏེ། དཔེར་ན་མིག་སྨན་བསྐུ་བའི་ཐུར་མ་བཞིན་ནོ།
en: However, as soon as they entered that place, their bodies became as small as the pin used to apply ointment to the eyes.

source: །དེ་དག་ཀྱང་རང་ཁྲོས་པའི་མཐུས་རེ་རེ་ཡང་འདི་ལྟ་བུའི་ལུས་རི་རབ་ཙམ་དུ་ཡང་དག་པར་ཤེས་ཏེ།
en: Still, due to the power of their anger, they all perceived their bodies to be as big as Mount Sumeru.

source: དེ་དག་གིས་སྐད་འབྱིན་ཀྱང་མ་ནུས་སོ། །དེ་ནས་འགྲོ་བར་ཡང་མ་ནུས་ཏེ། མྱ་ངན་ཆེན་པོ་དང་ཁྲོས་པས་ཟིལ་གྱིས་ནོན་ནས་དེར་འཁོད་དོ། །དེ་བཞིན་དུ་ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་རྒྱ་མཚོ་འཁོར་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། དེ་བཞིན་དུ་ས་སྲུང་གི་བུ་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་ཤིན་ཏུ་བརྟན་པ་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་འཇོག་པོ་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་མ་དྲོས་པ་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་བཏང་བཟུང་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་རྒྱ་མཚོས་བྱིན་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་ཆུ་ལྷས་བྱིན་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་ཁྱིམ་བདག་གིས་བྱིན་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་ཆུ་བས་བྱིན་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་ཆུ་སོག་མ་མེད་ཀྱིས་བྱིན་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་རི་བོས་བྱིན་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་བ་ལང་མགོ་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་རྒྱན་སྐྱེས་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་ཨེ་ལའི་འདབ་མ་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་ལག་པའི་ཚིགས་མི་མངོན་པ་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་སྒྲ་བསགས་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་མཚོ་གྱད་ཅེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་སྟོབས་ཀྱིས་རྒྱུ་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་ཏི་སེའི་གངས་མཐོ་བ་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་ཆུའི་ཤུགས་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་གཙུག་ཕུད་སྔོན་པོ་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་གསེར་སེར་སྐྱ་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་རྩྭ་སྔོན་པོ་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་གཤེ་བའི་ཤིང་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་མིག་གསལ་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་གླང་པོ་ཟད་ཅེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་རྣོན་པོས་བྱིན་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་གནས་ན་རྒྱུ་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་གཤོལ་ངན་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་ཨེ་ལའི་གདོང་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་མིག་དམར་ཞེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་ཡིད་འཕྲོག་ཅེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་རབ་མཆོག་ཅེས་བྱ་བའི་བར་དང་། དེ་བཞིན་དུ་འཛམ་བུའི་གླིང་འདི་ན་ཀླུའི་རྒྱལ་པོ་ལྔ་ཁྲི་དྲུག་སྟོང་གང་དག་ཡིན་པའི་བར་དེ་དག་ཐམས་ཅད་ཀླུའི་རྒྱལ་པོ་རེ་རེ་ཡང་འཁོར་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དྲང་སྲོང་ཐུབ་པའི་གནས་དེར་སྐྱབས་ཀྱི་དོན་དུ་རྟེན་ཅིང་ཞུགས་སོ།
en: They could neither call out nor leave that place, so they just sat there, overcome by misery and anger. Similarly, all fifty-six thousand nāga kings of Jambudvīpa, including the great nāga king Sāgara and his retinue of many trillions, Airāvaṇa, Supratiṣṭhita, Takṣaka, Anavatapta, Mucilinda, Samudradatta, Given by the Water God, Given by a Householder, Given by the River, Apalāladatta, Given by the Mountain, Gajaśīrṣa, Born from an Ornament, Elapatra, Invisible Wrists, Collection of Sounds, Strength of the Ocean, Karkoṭaka, High Snow Mountain, Strength of the Water, Blue Topknot, Pale Yellow Gold, Green Grass, Abused Tree, Bright Eyes, Elephant Extinction, Tīkṣṇadatta, Moving in Places, Bad Plough, Elavarṇa, Red Eyes, Attractive, and Supreme, entered that sacred site of wise sages to find shelter, each surrounded by retinues of many hundreds of thousands.

source: །གླིང་བརྒྱད་ཁྲི་བཞི་སྟོང་ནས་གླིང་རེ་རེ་ནས་ཀྱང་ཀླུ་ཆེན་པོ་བརྒྱ་སྟོང་ཕྲག་དུ་མས་རང་རང་གི་གནས་བོར་ནས་གནས་རྟེན་དེར་སྐྱབས་ཀྱི་དོན་དུ་རྟེན་ཅིང་ཞུགས་སོ།
en: In each of the eighty-four thousand continents, many hundreds of thousands of great nāgas also left their residences and entered that realm to find shelter.

source: །དེ་བཞིན་དུ་བྱང་གི་སྒྲ་མི་སྙན་ནས་ཀླུའི་རྒྱལ་པོ་ལུས་འབིགས་པའི་ཁབ་ཅེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱུ་བ་ཆེན་པོ་ཞེས་བྱ་བ་དེ་གཉིས་རེ་རེ་ཡང་ཀླུ་དང་། ཀླུ་ཆེན་པོ་དང་། ཀླུའི་རྒྱལ་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་ཡོངས་སུ་བསྐོར་ཅིང་དྲང་སྲོང་ཐུབ་པའི་གནས་དེར་སྐྱབས་ཀྱི་དོན་དུ་བརྟེན་ཏོ།
en: Similarly, the nāga kings Body-Piercing Needle and Great Movement, surrounded by myriads of nāgas, great nāgas, and nāga kings, left Uttarakuru in the north and came to that sacred site of wise sages for protection.

source: །ཤར་གྱི་ལུས་འཕགས་ཀྱི་གླིང་ནས་ཀླུའི་རྒྱལ་པོ་ཟླ་བ་སྲུང་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་དབྱིག་གཏོང་ཞེས་བྱ་བ་དེ་གཉིས་རེ་རེ་ཡང་ཀླུ་དང་། ཀླུ་ཆེན་པོ་དང་། ཀླུའི་རྒྱལ་པོ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ལྷན་ཅིག་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ་དྲང་སྲོང་ཐུབ་པའི་གནས་རྟེན་དེར་སྐྱབས་ཀྱི་དོན་དུ་རྟེན་ཅིང་ཞུགས་སོ།
en: The nāga kings Moon Protector and Wealth Giver, surrounded and attended by many trillions of nāgas, great nāgas, and nāga kings, left Pūrvavideha in the east, and they too entered that sacred site of wise sages to find shelter.

source: །བ་ལང་སྤྱོད་ཀྱི་གླིང་ནས་ཀླུའི་རྒྱལ་པོ་རིན་པོ་ཆེའི་ཕྲེང་བ་ཅན་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་བ་ལང་གི་འོད་ཀྱི་ཕྲེང་བ་ཅན་ཞེས་བྱ་བ་དེ་གཉིས་རེ་རེ་ཡང་ཀླུ་དང་། ཀླུ་ཆེན་པོ་དང་། ཀླུའི་རྒྱལ་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ལྷན་ཅིག་ཏུ་མདུན་དུ་བདར་ཞིང་དྲང་སྲོང་ཐུབ་པའི་གནས་དེར་སྐྱབས་ཀྱི་དོན་དུ་ཞུགས་སོ།
en: The nāga kings Endowed with Jewel Garlands and Endowed with Garlands of Light left Godānīya attended by myriads of nāgas, great nāgas, and nāga kings, and they also entered that sacred site of wise sages to find shelter.

source: །ཡང་དེའི་ཚེ་གླིང་བཞི་པ་འདི་དང་གླིང་གཞན་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་ན་ཀླུ་དང་། ཀླུ་ཆེན་པོ་དང་། ཀླུའི་སྐྱེ་གནས་པ་ཀླུ་སྒོ་ང་ལས་སྐྱེས་པ་དང་། ཀླུ་མངལ་ནས་སྐྱེས་པ་དང་། དྲོད་གཤེར་ལས་སྐྱེས་པ་དང་། རྫུས་ཏེ་སྐྱེས་པ་ཕོ་དང་། མོ་དང་། ཁྱེའུ་དང་། བུ་མོ་ཡང་རུང་། གང་སུ་དག་ཡོད་པ་སྐད་ཅིག་དེ་ལ་གང་དེར་བརྟེན་པར་མ་གྱུར་པ་གཅིག་ཀྱང་མེད་དེ།
en: At that time, within these four continents and eight million other continents, there was not a single nāga or great nāga—whether born from an egg, from a womb, from heat and moisture, or miraculously, whether male, female, boy, or girl—who did not immediately come to that sacred site of wise sages;

source: དྲང་སྲོང་ཐུབ་པའི་གནས་དེར་སྐྱབས་ཀྱི་དོན་དུ་ཞུགས་སོ།
en: they all entered that place to find shelter.

source: །དེ་དག་ཐམས་ཅད་ཞུགས་མ་ཐག་ཏུ་རེ་རེ་ཡང་འདི་ལྟ་བུའི་ལུས་ཆུང་ངུར་གྱུར་ཏེ། དཔེར་ན་མིག་སྨན་བསྐུ་བའི་ཐུར་མ་བཞིན་ནོ།
en: As soon as they entered it, each of their bodies became as small as the pin used to apply ointment to the eyes.

source: །དེ་དག་ཀྱང་རང་ཁྲོས་པའི་མཐུས་རེ་རེ་ཡང་འདི་ལྟ་བུའི་ལུས་རི་རབ་ཙམ་ཆེན་པོར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: However, due to the power of their anger, they all perceived that their bodies were as big as Mount Sumeru.

source: །དེ་ནས་དེའི་ཚེ་བདུད་སྡིག་ཅན་གྱིས་གནས་རྟེན་དུ་ཀླུའི་སྐྱེ་གནས་པ་ཐམས་ཅད་འདུས་པ་དང་། ཐམས་ཅད་ལུས་ཆུང་ངུར་མཐོང་ངོ་།
en: The evil Māra saw that all those nāgas had gathered in that realm and that their bodies had become small.

source: །དེ་མཐོང་བས་ཤས་ཆེར་འཁྲུགས་ཤིང་ཀུན་ཏུ་འཁྲུགས་ཏེ་སྐྲག་ནས་རང་གི་སྐྱེ་བོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འབྱུང་པོ་ཆེན་པོ་ཀླུ་རྣམས་ཐམས་ཅད་གཡོས།
en: When he saw this, he became exceedingly agitated, distressed, and scared. He said to his own faction, “Great demons, all the nāgas have moved away.

source: །དྲང་སྲོང་གནས་པ་དེར་ནི་འདུས་ནས་སུ། །ཐམས་ཅད་སྟོབས་དང་གཟུགས་དང་དཔལ་ལས་ཉམས།
en: They have gathered at that sacred site of wise sages, and their power, appearance, and magnificence have decreased.

source: །དགེ་སྦྱོང་མདངས་ཀྱི་སྟོབས་ལ་བལྟ་བར་བྱོས།
en: Look at the overwhelming power of that spiritual practitioner!”

source: །དེ་ནས་བདུད་ཤོར་བ་གཞན་ཚུལ་ཁྲིམས་རྟེན་ཞེས་བྱ་བ་དེས་སྨྲས་པ།
en: Another māra leader named Support of Discipline then said: “Do not be dejected.

source: ཐུགས་མི་དགྱེས་པ་མ་མཛད་བདག་ལ་གསོན།
en: Listen to me!

source: །ཀླུ་རྣམས་བདག་ཉིད་རྩེ་བ་འདི་ལགས་ཏེ།
en: This is a game of the nāgas. Think about that great assembly

source: །འདི་ལྟར་ཤཱཀྱའི་བུ་ནི་ཕྱེར་རློག་པའི། །ཚོགས་ཅན་འདུས་པ་ལ་ནི་མངོན་བརྟག་མཛོད།
en: That will crush the son of the Śākyas into dust!”

source: བློ་མཆོག་དེར་ནི་མྱུར་དུ་འགྲོ་བར་བྱོས།
en: “Clever one, quickly go to that place

source: །ཀླུ་ཡི་ཚོགས་ནི་ཐམས་ཅད་སྤྲོ་བར་བྱོས།
en: And generate enthusiasm in all those groups of nāgas!

source: །ཇི་སྟེ་ཤཱཀ་བུ་ཚོགས་བཅས་གསད་ནུས་ན།
en: If they are able to kill the son of the Śākyas and his assembly,

source: །ཀླུ་རྣམས་ཀྱི་ནི་ཡུལ་ཡང་མཆོག་ཏུ་འགྱུར།
en: The domains of the nāgas will become most eminent.”

source: །དེ་ནས་བདུད་ཤོར་བ་ཚུལ་ཁྲིམས་རྟེན་དེ་བདུད་ཀྱི་གནས་དེ་ནས་སྲོག་ཆགས་བརྒྱད་ཁྲི་དང་ལྷན་ཅིག་ཆས་སོ།
en: The māra leader Support of Discipline then departed from that abode of Māra together with eighty thousand creatures.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་སྔོན་གྱི་སྨོན་ལམ་མཐར་ཕྱིན་པས་དྲང་སྲོང་ཐུབ་པ་ཐམས་ཅད་དབང་དུ་མཛད།
en: Since his previous aspirations had been accomplished, the thus-gone Śākyamuni had gained dominion over all wise sages.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་མཛད། སངས་རྒྱས་ཀྱི་ཡུལ་ཐམས་ཅད་ཀྱི་ཆོ་འཕྲུལ་གྱི་བྱིན་གྱི་རླབས་ཀྱི་རྒྱུ་འཐུན་པ་བཤད་པ་ཡང་དག་པར་བསྟན།
en: He was ripening all beings and gave teachings that were the outcome of the magical powers of all the domains of the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་སྐྱོ་བར་མཛད། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་ཞེས་བྱ་བ་ནས་མི་དང་། མི་མ་ཡིན་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་མཛད།
en: He was inducing weariness in all the bodhisattva great beings and bringing delight to all the gods, nāgas, yakṣas, humans, and nonhumans.

source: སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཐམས་ཅད་ཤིན་ཏུ་ཡོངས་སུ་སྤྱད་པ་མཛད། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཐམས་ཅད་ཀྱི་ནང་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་མཆོག་ཏུ་ཆེས་གཟི་བརྗིད་དང་ལྡན་པ་དང་། ཆེས་སྐལ་བ་དང་ལྡན་པ་དང་། ཆེས་བསོད་ནམས་ཀྱི་ས་བོན་བྱེད་པའི་མདངས་དང་ལྡན་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་མཆོད་པར་འོས་པ་མཛད་དེ།
en: He engaged with this entire buddha realm, causing it to become the most magnificent of all the pure buddha realms and making it most fortunate, endowed with the great splendor that plants the seeds of merit, and worthy to be worshiped in all the buddha realms.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པས་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་རྒྱུན་བཅད་དོ།
en: The Thus-Gone One then interrupted the manifestation of his magical displays.

source: །དེ་ལ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་སེམས་ཅན་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་ཆུད་པར་གྱུར་ཏེ། དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ཀྱིས་ཤེས་པ་སོ་སོར་སྦྱངས་སོ།
en: While they were present inside the body of the Blessed One, the perceptions of everyone in this buddha realm were purified by him.

source: །དེ་བཞིན་གཤེགས་པས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་གྱི་རྒྱུ་འཐུན་པའི་ཆོ་འཕྲུལ་གྱི་བྱིན་གྱི་རླབས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་རྒྱུན་བཅད་པ་དང་། དེའི་ཚེ་སྔོན་ཇི་ལྟར་བཞུགས་པ་བཞིན་དུ་ཡང་དག་པར་སྣང་སྟེ།
en: Now, as the Thus-Gone One interrupted the power of his absorption of miraculous transformation, which is an outcome of the domain of all the buddhas, he reappeared as he was before.

source: དེ་དེ་ལྟར་ཤིན་ཏུ་ལྷམ་མེ། ལྷན་ནེ། ལྷང་ངེར་བཞུགས་སོ། །དེ་དེའི་བར་དུ་ཡང་རང་གི་གཟི་བརྗིད་ཀྱི་འོད་ཟེར་རྣམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྣང་བས་ཁྱབ་པར་མཛད་ནས་བཞུགས་སོ།
en: He was extremely radiant, clear, and brilliant, and all the buddha realms were bathed in the light rays of his magnificence.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དེ་དག་ཐམས་ཅད་ངོ་མཚར་ཐོབ་ཅིང་རྨད་དུ་བྱུང་བ་ཐོབ་སྟེ། བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་དང་། དྲི་དང་། ཕྱེ་མ་དང་། རིན་པོ་ཆེ་དང་། རས་བཅོས་བུ་དང་། ཆོས་གོས་དང་། ཕྱང་འཕྲུལ་དང་། རྒྱན་སྣ་ཚོགས་དང་། རོལ་མོའི་སྒྲ་སྣ་ཚོགས་ཀྱིས་མཆོད་པ་བྱས་ཏེ།
en: Amazed and astonished, all the many hundreds of thousands of bodhisattva great beings worshiped the Blessed One with offerings of flowers, perfumes, powders, precious gems, fine fabrics, Dharma robes, and necklaces, as well as a variety of ornaments and musical tunes.

source: བསྐོར་བ་བྱས་ནས་སྤྱན་སྔར་འཁོད་དོ།
en: They circumambulated the Blessed One and sat in front of him.

source: །དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་རྣམས་ཞེས་བྱ་བ་ནས་དེ་བཞིན་དུ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། གྲུལ་བུམ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། སྲུལ་པོ་དང་། ལུས་སྲུལ་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་ཐམས་ཅད་ཀྱི་བར་དེ་དག་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་དང་། དྲི་དང་། ཕྱེ་མ་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་དང་། རས་བཅོས་བུ་དང་། ཆོས་གོས་དང་། ཕྱང་འཕྲུལ་དང་། རྒྱན་སྣ་ཚོགས་ཞེས་བྱ་བ་ནས་མཆོད་པའི་བར་དུ་བྱས་ཏེ།
en: Similarly, the Blessed One’s hearers and all the gods, nāgas, yakṣas, asuras, garuḍas, kinnaras, mahoragas, kumbhāṇḍas, pretas, piśācas, pūtanas, kaṭapūtanas, humans, and nonhumans worshiped him with offerings of flowers, perfumes, powders, precious gems, fine fabrics, Dharma robes, necklaces, and a variety of ornaments.

source: བསྐོར་བ་བྱས་ནས་ཆོས་ཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དོ།
en: They circumambulated him and sat in front of him to listen to the Dharma.

source: །བདུད་ཤོར་བ་ཚུལ་ཁྲིམས་རྟེན་བདུད་ཀྱི་རིས་བརྒྱད་ཁྲི་དང་དེ་ནས་འཛམ་བུའི་གླིང་འདིར་བབས་ནས། དགེ་སྦྱོང་གཽ་ཏ་མས་སྐུ་ཡངས་པ་ཀུན་ཏུ་བསྟན་པ་ཇི་ལྟར་རྒྱུན་བཅད་པ་མཐོང་སྟེ། དེ་ཡུལ་མ་ག་དྷཱ་ན་བཞུགས་པར་ཀུན་ཏུ་སྣང་ངོ་།
en: At the same time, the māra leader Support of Discipline and his army of eighty thousand māras landed in Jambudvīpa, and they saw how the spiritual practitioner Gautama had interrupted the display of his vast body and that he was now again dwelling in the land of Magadha.

source: །དེ་བདག་ཅག་གིས་སྐྲག་པས་སྒྱུའི་སྟོབས་ལས་མ་ཉམས་སམ་སྙམ་ཞིང་།
en: They wondered, “Did his magical powers become weak because he is afraid of us?

source: ད་ལྟ་ན་དེར་འཁོར་དང་བཅས་ཏེ་འདུས་པའི་ནང་དུ་འདུག་ན། དེ་བདག་ཅག་གི་ཕྱིར་འདུག་ནས་སྡིག་པ་མི་བྱེད་དམ་སྙམ་སྟེ།
en: As he now sits there with his retinue within that assembly, is he not committing negative deeds by staying there because of us?

source: གང་བདག་ཅག་གིས་དེར་དང་པོར་སོང་ནས་འདི་ལ་རྒྱུ་གང་ཡིན་པར་འགྱུར་བ་མཉན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ།
en: We must definitely go there right away and hear the reason for this!”

source: །དེ་ནས་བདུད་ཤོར་བ་ཚུལ་ཁྲིམས་རྟེན་འཁོར་དང་བཅས་ཏེ་དེ་ནས་བབས་ནས།
en: The māra leader Support of Discipline and his retinue then proceeded toward the place where the Blessed One was staying.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ། དེའི་ཚེ་ཡང་དེས་ཚིགས་སུ་བཅད་པ་སྤོབས་པར་བྱས་པ།
en: When they arrived, they sat down before the Blessed One, and Support of Discipline uttered this verse:

source: ཁྱོད་ཀྱིས་ནད་ནི་ཆེན་པོ་དག །རྒ་ཤིའི་མཚོ་ལས་མ་རྒལ་ཏོ།
en: “You have not yet crossed the ocean Of severe disease, old age, and death!

source: །འདི་ལྟར་སེམས་ཅན་སླུ་བྱེད་ན།
en: When you deceive sentient beings in this way,

source: །བྱང་གྲོལ་ཏུ་ནི་ཇི་ལྟར་ཞུགས།
en: How could you have reached emancipation?”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བདུད་ཤོར་བ་ཚུལ་ཁྲིམས་རྟེན་ལ་ཚིགས་སུ་བཅད་ནས་སླར་བཀའ་སྩལ་པ།
en: The Blessed One replied in verse to the māra leader Support of Discipline:

source: ང་ནི་སེམས་ཅན་ཆུ་བོ་རྒལ།
en: “I have crossed the river of existence,

source: །ང་ལ་ཡང་སྲེད་མེད་པ་ཡིན།
en: I am free from craving,

source: །སེམས་ཅན་རྣམས་ལ་ཐུགས་བརྩེའི་ཕྱིར། །སྲོག་ཆགས་རྣམས་ལ་ཆོས་སྟོན་ཏོ།
en: And I teach the Dharma to beings Out of affection for them.

source: །འཁོར་བར་ཡུན་རིངས་བརྩམས་ནས་སུ།
en: “A long time ago in cyclic existence,

source: །ཁྱོད་ཀྱིས་བྱང་ཆུབ་ཕྱིར་སྤྱད་དེ། །མར་མེ་མཛད་ནི་ཚུན་ཆད་དུ།
en: You practiced for the sake of awakening.

source: །སྦྱིན་དང་ཚུལ་ཁྲིམས་ཀུན་ཏུ་བསྒྲུབས།
en: You accomplished generosity and discipline Since the time of Dīpaṅkara.

source: །སངས་རྒྱས་བྱེ་བ་ཕྲག་སྟོང་པོ། །དེ་དག་ཁྱོད་ཀྱིས་རི་མོར་བྱས།
en: “You have venerated Ten billion buddhas,

source: །ཐེག་པ་མཆོག་གི་དོན་དུ་ནི། །ང་ཡིས་ཁྱོད་ལ་ལུང་བསྟན་ཏེ།
en: And I have given a prophecy to you For the sake of the Supreme Vehicle.

source: །སྦྱངས་པའི་ཡོན་ཏན་ཀུན་ཏུ་སྤྱད།
en: “You have trained in the ascetic practices

source: །མཚན་མ་མེད་པར་རྣམ་པར་བསྒོམས།
en: And thoroughly meditated on the absence of marks.

source: །ང་ཡིས་མིག་རྣམས་དག་པ་སྦྱིན།
en: I am giving you pure eyes,

source: །སྔོན་གྱི་ཚེ་རབས་དྲན་པར་བྱོས།
en: So remember your past lives!”
